In [2]:
import pandas as pd

In [4]:
animals=["cat","dog","tiger"]

pd.Series(animals)  #S必须大写

0      cat
1      dog
2    tiger
dtype: object

In [5]:
numers=[1,2,3]

pd.Series(numers)

0    1
1    2
2    3
dtype: int64

In [7]:
animals=["cat","dog",None]  #N必须大写 , missing data

pd.Series(animals)

0     cat
1     dog
2    None
dtype: object

In [8]:
numers=[1,2,None]

pd.Series(numers)

0    1.0
1    2.0
2    NaN
dtype: float64

In [10]:
import numpy as np

In [11]:
np.nan == None

False

make an series using dictionary created

In [15]:
sports={
    "pingpong":"China",
    "teakwondo":"Korea",
    "swimming": "USA",
    "golf":"UK"
    
}


s=pd.Series(sports)

s

pingpong     China
teakwondo    Korea
swimming       USA
golf            UK
dtype: object

adding index winthin create a series

In [17]:
s=pd.Series(["Tiger","Fish","Cat"] ,
            index=["US","India","China"]  #adding index here
            )
s

US       Tiger
India     Fish
China      Cat
dtype: object

#query a series

In [18]:
sports={
    "pingpong":"China",
    "teakwondo":"Korea",
    "swimming": "USA",
    "golf":"UK"
    
}


s=pd.Series(sports)

s

pingpong     China
teakwondo    Korea
swimming       USA
golf            UK
dtype: object

In [19]:
s.iloc[3]  #iloc: what is the nth value (index position)

'UK'

In [22]:
s.loc["swimming"] #loc: what is the value with this index  (index label)

'USA'

In [23]:
s = pd.Series([100.00, 120.00, 101.00, 3.00])
s

0    100.0
1    120.0
2    101.0
3      3.0
dtype: float64

In [25]:
total=0
for item in s:
    total+=item  # =+ means:  x += n  x = x + n
    print(total)

100.0
220.0
321.0
324.0

In [26]:
total=0
for item in s:
    total+=item  # =+ means:  x += n  x = x + n
    
print(total)

324.0

In [27]:
import numpy as np

In [28]:
total= np.sum(s)

print(total)

324.0

In [38]:
#this creates a big series of random numbers
s = pd.Series(
    np.random.randint(0,1000,10000)
)

In [34]:
data = pd.Series(np.arange(10) ** 2)
data

0     0
1     1
2     4
3     9
4    16
5    25
6    36
7    49
8    64
9    81
dtype: int32

In [41]:
s.head()  # default show first 5

0    618
1    130
2    843
3    785
4    269
dtype: int32

In [42]:
len(s)

10000

In [43]:
s+=2 #adds two to each item in s using broadcasting
s.head()

0    620
1    132
2    845
3    787
4    271
dtype: int32

In [52]:
s = pd.Series([1, 2, 3])
s.loc['Animal'] = 'Bears'  #append a new line
print(s)   # if there is no lines after, no need to use print, can simply be s

y = 1

0             1
1             2
2             3
Animal    Bears
dtype: object

In [3]:
original_sports = pd.Series({'Archery': 'Bhutan',
                             'Golf': 'Scotland',
                             'Sumo': 'Japan',
                             'Taekwondo': 'South Korea'})
cricket_loving_countries = pd.Series(['Australia',
                                      'Barbados',
                                      'Pakistan',
                                      'England'], 
                                   index=['Cricket',
                                          'Cricket',
                                          'Cricket',
                                          'Cricket'])
all_countries = original_sports.append(cricket_loving_countries)

In [4]:
original_sports  #? when to use print?

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [47]:
cricket_loving_countries

Cricket    Australia
Cricket     Barbados
Cricket     Pakistan
Cricket      England
dtype: object

In [48]:
all_countries

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
Cricket        Australia
Cricket         Barbados
Cricket         Pakistan
Cricket          England
dtype: object

In [49]:
all_countries.loc['Cricket']

Cricket    Australia
Cricket     Barbados
Cricket     Pakistan
Cricket      England
dtype: object

#DataFrame

In [5]:
purchase1=pd.Series({
      'Name': 'Chris',
      'Item Purchased': 'Dog Food',
      'Cost': 22.50  
})
purchase2=pd.Series({
      'Name': 'Kevyn',
      'Item Purchased': 'Kitty Litter',
      'Cost': 2.50  
})
purchase3=pd.Series({
     'Name': 'Vinod',
     'Item Purchased': 'Bird Seed',
     'Cost': 5.00 
})

total_purchase = pd.DataFrame(
                [purchase1,purchase2,purchase3],
                index=["Store1","Store1", "Store2"]
)

print(total_purchase)

         Name Item Purchased  Cost
Store1  Chris       Dog Food  22.5
Store1  Kevyn   Kitty Litter   2.5
Store2  Vinod      Bird Seed   5.0

In [5]:
total_purchase.loc["Store2"]

Name                  Vinod
Item Purchased    Bird Seed
Cost                      5
Name: Store2, dtype: object

In [6]:
total_purchase.loc["Store1"]

         Name Item Purchased  Cost
Store1  Chris       Dog Food  22.5
Store1  Kevyn   Kitty Litter   2.5

In [7]:
total_purchase["Item Purchased"] #only query the selected col

Store1        Dog Food
Store1    Kitty Litter
Store2       Bird Seed
Name: Item Purchased, dtype: object

In [8]:
total_purchase.T  # transpose

                  Store1        Store1     Store2
Name               Chris         Kevyn      Vinod
Item Purchased  Dog Food  Kitty Litter  Bird Seed
Cost                22.5           2.5          5

In [9]:
total_purchase["Cost"]

Store1    22.5
Store1     2.5
Store2     5.0
Name: Cost, dtype: float64

In [11]:
total_purchase.T.loc["Cost"]

Store1    22.5
Store1     2.5
Store2       5
Name: Cost, dtype: object

In [12]:
total_purchase["Cost"]  # select col Cost

Store1    22.5
Store1     2.5
Store2     5.0
Name: Cost, dtype: float64

In [16]:
total_purchase.loc["Store1"]["Cost"] # select row, and col

Store1    22.5
Store1     2.5
Name: Cost, dtype: float64

In [17]:
total_purchase.loc[:,["Name","Cost"]]  
# 1st element is always Rows, : select all rows, then a list of selected cols

         Name  Cost
Store1  Chris  22.5
Store1  Kevyn   2.5
Store2  Vinod   5.0

In [19]:
total_purchase.drop("Store1")

         Name Item Purchased  Cost
Store2  Vinod      Bird Seed   5.0

In [20]:
total_purchase  # the original series remain not changes

         Name Item Purchased  Cost
Store1  Chris       Dog Food  22.5
Store1  Kevyn   Kitty Litter   2.5
Store2  Vinod      Bird Seed   5.0

In [22]:
copy1 =  total_purchase.copy()
copy1

         Name Item Purchased  Cost
Store1  Chris       Dog Food  22.5
Store1  Kevyn   Kitty Litter   2.5
Store2  Vinod      Bird Seed   5.0

In [23]:
copy1=copy1.drop("Store1")
copy1

         Name Item Purchased  Cost
Store2  Vinod      Bird Seed   5.0

In [24]:
copy2=total_purchase.copy()

del copy2["Name"]  # delete col
copy2

       Item Purchased  Cost
Store1       Dog Food  22.5
Store1   Kitty Litter   2.5
Store2      Bird Seed   5.0

In [ ]:
# ? how to delete rows in dataframe?

DataFrame Indexing and Loading

In [9]:
costs = total_purchase["Cost"]  
#create a series based on just the cost category using the square brackets
costs

Store1    22.5
Store1     2.5
Store2     5.0
Name: Cost, dtype: float64

In [ ]:
#increase the cost in this series using broadcasting.

In [10]:
costs+=2
costs

Store1    24.5
Store1     4.5
Store2     7.0
Name: Cost, dtype: float64

In [11]:
total_purchase # why the original df has changed??

         Name Item Purchased  Cost
Store1  Chris       Dog Food  24.5
Store1  Kevyn   Kitty Litter   4.5
Store2  Vinod      Bird Seed   7.0

In [150]:
DATASET_LOCATION = "C:\\Users\\jianx\\Downloads\\"

In [151]:
df = pd.read_csv(DATASET_LOCATION + 'olympics.csv')  #can't find csv. how to import
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15
0,NaN,№ Summer,01 !,02 !,03 !,Total,№ Winter,01 !,02 !,03 !,Total,№ Games,01 !,02 !,03 !,Combined total
1,Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
2,Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
3,Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
4,Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12

In [152]:
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})

df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store 1', 'Store 1', 'Store 2'])

In [153]:
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [16]:
# df["Location"] =df.index
# df

          Name Item Purchased  Cost Location
Store 1  Chris       Dog Food  22.5  Store 1
Store 1  Kevyn   Kitty Litter   2.5  Store 1
Store 2  Vinod      Bird Seed   5.0  Store 2

In [17]:
# df = df.set_index(["Location", "Name"])

# df

               Item Purchased  Cost
Location Name
Store 1  Chris       Dog Food  22.5
         Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [23]:
df = df.set_index([df.index,"Name"]) # multi level index

#use original index - Store, and name, as new index


#reb=name original index - Store to Location as a new index name

df.index.names=(["Location", "Name"])

df

               Item Purchased  Cost
Location Name
Store 1  Chris       Dog Food  22.5
         Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

Missing Value

Assignment

In [25]:
import pandas as pd

In [158]:
df.loc[:, "countryName"] = df.index.str.split("(").str[0].str.strip()
df.loc[:, "countryCode"] = df.index.str.split("(").str[1].str.split(")").str[0].str.strip()
df.head()

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total,countryName,countryCode
Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2,Afghanistan,AFG
Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15,Algeria,ALG
Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70,Argentina,ARG
Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12,Armenia,ARM
Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12,Australasia,ANZ

In [159]:
df = df.iloc[:-1, :]
df.tail()

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total,countryName,countryCode
Yugoslavia (YUG) [YUG],16,26,29,28,83,14,0,3,1,4,30,26,32,29,87,Yugoslavia,YUG
Independent Olympic Participants (IOP) [IOP],1,0,1,2,3,0,0,0,0,0,1,0,1,2,3,Independent Olympic Participants,IOP
Zambia (ZAM) [ZAM],12,0,1,1,2,0,0,0,0,0,12,0,1,1,2,Zambia,ZAM
Zimbabwe (ZIM) [ZIM],12,3,4,1,8,1,0,0,0,0,13,3,4,1,8,Zimbabwe,ZIM
Mixed team (ZZX) [ZZX],3,8,5,4,17,0,0,0,0,0,3,8,5,4,17,Mixed team,ZZX

Question 0 (Example)
What is the first country in df?

This function should return a Series.

In [163]:
# You should write your whole answer within the function provided. The autograder will call
# this function and compare the return value against the correct solution value
def answer_zero():
    # This function returns the row for Afghanistan, which is a Series object. The assignment
    # question description will tell you the general format the autograder is expecting
    return df.iloc[0]

# You can examine what your function returns by calling it in the cell. If you have questions
# about the assignment formats, check out the discussion forums for any FAQs
answer_zero()

# Summer                   13
Gold                        0
Silver                      0
Bronze                      2
Total                       2
# Winter                    0
Gold.1                      0
Silver.1                    0
Bronze.1                    0
Total.1                     0
# Games                    13
Gold.2                      0
Silver.2                    0
Bronze.2                    2
Combined total              2
countryName       Afghanistan
countryCode               AFG
Name: Afghanistan (AFG), dtype: object

Question 1
Which country has won the most gold medals in summer games?

This function should return a single string value.

In [161]:
def answer1():
    df_sorted = df.sort_values(by="Gold", ascending=False)
#     print(df_sorted.head())
    return df_sorted["countryName"][0]


answer1()

'United States'

In [66]:

# get the maximum value of the column 'Gold'

most_gold_summer = df['Gold'].max()

most_gold_summer

976

In [ ]:
#then find out what's the corresponding country

In [56]:
most_gs_ctry = df.loc[df['Gold'].idxmax()]  #why indxmax() not max

most_gs_ctry

# Summer            26
Gold               976
Silver             757
Bronze             666
Total             2399
# Winter            22
Gold.1              96
Silver.1           102
Bronze.1            84
Total.1            282
# Games             48
Gold.2            1072
Silver.2           859
Bronze.2           750
Combined total    2681
ID                 USA
Name: United States, dtype: object

In [68]:
# only return index as a string

# Select all the rows which satisfies the criteria 
# convert the collection of index labels to list. 

Index_name =  df.loc[df['Gold'].idxmax()] .index.tolist() 
  
# Print all the labels 
print(Index_name)

['# Summer', 'Gold', 'Silver', 'Bronze', 'Total', '# Winter', 'Gold.1', 'Silver.1', 'Bronze.1', 'Total.1', '# Games', 'Gold.2', 'Silver.2', 'Bronze.2', 'Combined total', 'ID']

In [80]:
#answer 1

test_ctry= (df["Gold"]).idxmax()

test_ctry

'United States'

Question 2
Which country had the biggest difference between their summer and winter gold medal counts?

This function should return a single string value.

In [76]:
 gap=  df["Gold"]-df["Gold.1"] 

gap.head()

Afghanistan     0
Algeria         5
Argentina      18
Armenia         1
Australasia     3
dtype: int64

In [78]:
biggest_gap= (gap).idxmax()

biggest_gap

'United States'

In [81]:
#answer 2

biggest_gap = (df["Gold"]-df["Gold.1"] ).idxmax()
biggest_gap

'United States'

Question 3
Which country has the biggest difference between their summer gold medal counts and winter gold medal counts relative to their total gold medal count?

 (summer gold - winter gold)/ total gold
 
Only include countries that have won at least 1 gold in both summer and winter.

This function should return a single string value.

In [165]:
df[:3]

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total,countryName,countryCode
Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2,Afghanistan,AFG
Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15,Algeria,ALG
Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70,Argentina,ARG

In [190]:
# pang pang

df_result = pd.DataFrame(index=df.index)

df_result.loc[:, "Summer Gold"] = df.loc[:, "Gold"]
df_result.loc[:, "Winter Gold"] = df.loc[:, "Gold.1"]
df_result.loc[:, "Gold Ratio"] = (df_result["Summer Gold"] - df_result["Winter Gold"]) / (df_result["Summer Gold"] + df_result["Winter Gold"])
df_result.loc[:, "eligible"] = (df_result["Summer Gold"] >= 1) & (df_result["Winter Gold"]) >= 1

df_result.loc[:, "Country Name"] = df.loc[:, "countryName"]

# df_result.loc[df_result["Country Name"] == "United States", :]

df_result.loc[df_result["eligible"]].sort_values(by="Gold Ratio", ascending=False)["Country Name"][0]

'Bulgaria'

Question 4
Write a function that creates a Series called "Points" which is a weighted value where each gold medal (Gold.2) counts for 3 points, silver medals (Silver.2) for 2 points, and bronze medals (Bronze.2) for 1 point. The function should return only the column (a Series object) which you created, with the country names as indices.

This function should return a Series named Points of length 146

In [ ]:
#create a list

points_system = {
    
    
    df.[]
}

In [ ]:
Ser_4 = Series()